app/Controllers/SesionController.php

SELECT *
FROM "registros"
WHERE "correo" = 'usuario@empresa.com'
 LIMIT 1
---
    public function stores()
    {
        $session = session();
        $usuariosModel = new RegistrosModel();

        $correo = $this->request->getPost('correo');
        $contrasena = $this->request->getPost('contrasena');

        $usuario = $usuariosModel->where('correo', $correo)->first();