app/Controllers/VacantesController.php

    public function bolsa_emp()
    {
        try {
            $busqueda = $this->request->getGet('busqueda');
            $pagina = $this->request->getGet('page_vacantes') ?? 1;

            $porPagina = 5;

            $vacantesQuery = $this->vacanteModel->where('estatus', 'activo');

            if (!empty($busqueda)) {
                $vacantesQuery->groupStart()
                    ->like('LOWER(titulo)', $busqueda)
                    ->orLike('LOWER(salario)', $busqueda)
                    ->orLike('LOWER(detalles)', $busqueda)
                    ->groupEnd();
            }

            $data['vacantes'] = $vacantesQuery
            ->orderBy('fecha', 'DESC') //ASC
            ->paginate($porPagina, 'vacantes', $pagina);
---
SELECT *
FROM "vacantes"
WHERE "estatus" = 'activo'
ORDER BY "fecha" DESC
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "vacantes"
WHERE "estatus" = 'activo'